[
  "CMSC 216 Final To what extent is instructor Larry Herman’s CMSC 216 final cumulative. Does he actually ask stuff from midterm 1 and 2 or mostly content covered after.",
  "Herman 216 Guys I am currently struggling in CMSC216 with Larry Herman, a lot of the projects have still yet to be graded and my absences to be resolved but I put my worst case hypothetical grades into Canvas and I will be at around 72.",
  "Advice for Acing CMSC132 Midterm with Larry Herman. I am trying to prepare for an upcoming midterm of CMSC132 taught by Larry Herman, and I was hoping to gain insight on how I should prepare for the exam to ace it.",
  "Larry Herman = Bill Gates? I attend all of Larry's lectures for my CMSC132 class, and while I don't really sometimes fully pay attention to the lectures, sometimes I look at Larry's face... and I don't know it gets me thinking.",
  "CMSC132 (Larry Herman) Why is it taking this long for grades to be put into the grade book? I’d understand if it was a few grades that haven’t been submitted, but I’m still waiting for 5 of the 9 projects to be returned along with the final.",
  "Larry Herman VS Nora Burkhauser for CMSC132 (Fall 2024) I am debating whether to take Larry Herman or Nora Burkhauser for CMSC132 (Fall 2024). I have heard mixed reviews about Larry so would anyone recommend him for CMSC132 for someone who is new to programming?",
  "Love you Larry Herman",
  "CMSC216 Herman Final How bad is Larry Herman's 216 final, I'm close to failing...but I need to do really good on the final",
  "Great clarity in presentation, very patient and helpful.",
  "Extremely student-friendly & helpful, always wants students to understand concepts. Replies to emails all the time & very approachable during office hours. posted previous years' exams to help prepare better. cares about his students, explains difficult concepts with models.",
  "Fantastic Professor, look forward to being in another of his classes this next semester. He is not the easiest professor, but he is clear, and good at communicating the material he is teaching.",
  "Amazing professor. Lectures might get boring sometimes towards the end.",
  "Very helpful and patient specially during office hours."
] 